Courses/7140/Lectures/Implementation/Languages/paradigms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Programming Paradims for Software Engineering</title>
<!-- 2016-04-13 Wed 08:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Programming Paradims for Software Engineering</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Programming Paradigms</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>"The notion of programming paradigms is a way to classify
programming languages," &#x2013; Wikipedia
<ol class="org-ol">
<li>This is a wrong view.
</li>
<li>It is a way to classify programming "styles."
</li>
</ol>
</li>
<li>Some PLs have multiple paradigms.
</li>
<li><a href="http://rosettacode.org/">rosettacode.org</a> Solutions to the same task in different languages.
</li>
<li><a href="https://rosetta.alhur.es/">rosetta.alhur.es</a> Compare any two PLs solutions
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Procedural Paradigm</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Examples: C/C++, Java, Python, Scala
</li>
<li>AKA Imperative/ Operational Paradigm
</li>
<li>(Almost all) OOP languages belong here.
</li>
<li>Process/Program State is operated on by statements
</li>
<li>Changes made are globally visible.
</li>
<li><a href="http://rosettacode.org/wiki/Category:Solutions_by_Programming_Task">RosettaCode.org</a>:: <a href="http://rosettacode.org/wiki/Sorting_algorithms/Quicksort">Quick Sort</a> in <a href="http://rosettacode.org/wiki/Sorting_algorithms/Quicksort#Java">Java</a>, <a href="http://rosettacode.org/wiki/Sorting_algorithms/Quicksort#Scala">Scala</a>.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Functional Programming</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Examples: ML/ OCaml, Haskell, Scala (hybrid)
</li>
<li>No state; functions and expressions have no side-effects
</li>
<li>Obviously, IO and environment changes are needed &#x2013; handled in
an ad hoc way.
</li>
<li>Functions etc. are "first class" values. (i.e., computable
within the PL)
</li>
<li>Compute a value, and return it as a result.
</li>
<li><a href="http://rosettacode.org/wiki/Category:Solutions_by_Programming_Task">RosettaCode.org</a>:: Bubble Sort in <a href="http://rosettacode.org/wiki/Sorting_algorithms/Bubble_sort#Haskell">Haskell</a>; Quick Sort in <a href="http://rosettacode.org/wiki/Sorting_algorithms/Quicksort#Haskell">Haskell</a>, <a href="http://rosettacode.org/wiki/Sorting_algorithms/Quicksort#OCaml">OCaml</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Logic Programming.</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Examples: Prolog, Datalog
</li>
<li>AKA Declarative Paradigm
</li>
<li>Based on mathematical logic.  But, not full scale, but highly
studied subsets in the context of implementations.
</li>
<li>State is a collection of "facts" (axioms + inference rules +
deduced).
</li>
<li>Queries: (Program execution) systematic search in the state
</li>
<li>Queries may have unbound variables.  The answer then yields all
possible value that make the query true.
</li>
<li><a href="http://rosettacode.org/wiki/Category:Solutions_by_Programming_Task">RosettaCode.org</a>:: Quick Sort in <a href="http://rosettacode.org/wiki/Sorting_algorithms/Quicksort#Prolog">Prolog</a>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-11
</div>
</body>
</html>
